W7D2/MusicApp/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ajay@g.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, pass)
        user = User.find_by(email: email)