W7D2/MusicApp/app/controllers/application_controller.rb

    def current_user
        user = User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "IA-9ttjHtnFG1qTuX_5aDw"], ["LIMIT", 1]]