W7D2/MusicApp/app/controllers/bands_controller.rb

    def create
        band = Band.new(params.require(:band).permit(:name))

        if band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Young Raj"], ["created_at", "2020-05-19 23:29:39.013588"], ["updated_at", "2020-05-19 23:29:39.013588"]]