W7D5/Gheddit/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "tS1VzwbPrKdz2j8tXrz6AQ"], ["LIMIT", 1]]
---
    def current_user
        #current logged in user
        @current_user ||= User.find_by(session_token: session[:session_token])