W7D5/Gheddit/app/controllers/posts_controller.rb

    def current_post
        Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]