W7D5/Gheddit/app/controllers/subs_controller.rb

    def current_sub
        Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create

        sub = Sub.new(sub_params)
        sub.moderator_id = current_user.id
        if sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My Sub"], ["description", "sub1"], ["moderator_id", 3], ["created_at", "2020-05-22 23:20:16.597941"], ["updated_at", "2020-05-22 23:20:16.597941"]]

    def update
        @sub = current_sub

        if @sub.update(sub_params)
---
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "none"], ["description", "ff"], ["updated_at", "2020-05-22 20:47:28.003845"], ["id", 3]]

    def destroy
        @sub = current_sub
        @sub.destroy
---
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 4]]