W7D5/Gheddit/app/controllers/users_controller.rb

    def create
        # debugger
        @user = User.new(user_params)
        @user.password = params[:user][:password]
        # debugger
        if @user.save
---
INSERT INTO "users" ("username", "pw_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"