W7D5/Gheddit/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "stickmanbob"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username,pass)
        user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "pw_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["session_token", "tS1VzwbPrKdz2j8tXrz6AQ"], ["pw_digest", "$2a$12$oF6Zr0PQoXWBDrvVOXrSLukmD8lL9.paRND3WAPReF.lbQGTgyWJS"], ["updated_at", "2020-05-22 18:32:29.429798"], ["id", 3]]
---
    def reset_session_token!
        #must reset session_token and save to db
        self.session_token = make_session_token
        self.save!