W6D4/art_share/app/controllers/artwork_shares_controller.rb

    def create
        share = ArtworkShare.new(share_params)

        if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 11], ["created_at", "2020-05-13 23:23:56.035410"], ["updated_at", "2020-05-13 23:23:56.035410"]]

    def destroy
        catch_record_not_found do
            share = ArtworkShare.find(params[:id])
            share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]

    def favorite
        catch_record_not_found do
            catch_parameter_missing do
                artwork_share = ArtworkShare.find(params[:id])
                if artwork_share.update(params.require(:artwork_share).permit(:favorite))
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", true], ["updated_at", "2020-05-14 17:42:30.785377"], ["id", 2]]