W6D4/art_share/app/controllers/artworks_controller.rb

SELECT artworks.*,shared_artworks_users.* FROM "users" INNER JOIN "artworks" ON "artworks"."artist_id" = "users"."id" INNER JOIN "artwork_shares" ON "artwork_shares"."viewer_id" = "users"."id" INNER JOIN "artworks" "shared_artworks_users" ON "shared_artworks_users"."id" = "artwork_shares"."artwork_id" WHERE "users"."id" = $1  [["id", 12]]
SELECT artworks.* FROM "users" INNER JOIN "artwork_shares" ON "artwork_shares"."viewer_id" = "users"."id" INNER JOIN "artworks" ON "artworks"."id" = "artwork_shares"."artwork_id" WHERE "users"."id" = $1  [["id", 12]]
---
    def index
        user_artworks = User.select('artworks.*').joins(:artworks).where(id: params[:user_id])
        shared_artworks = User.select('artworks.*').joins(:shared_artworks).where(id: params[:user_id])

INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        catch_record_not_found do
            artwork = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Bathroom Photo"], ["updated_at", "2020-05-13 23:11:11.504243"], ["id", 4]]
---
    def update
        catch_record_not_found do
            artwork = Artwork.find(params[:id])
            if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]
---
    def destroy
        catch_record_not_found do
            artwork = Artwork.find(params[:id])
            artwork.destroy

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", true], ["updated_at", "2020-05-14 17:37:19.806763"], ["id", 2]]
---
    def favorite
        catch_record_not_found do
            catch_parameter_missing do
                artwork = Artwork.find(params[:id])
                if artwork.update(params.require(:artwork).permit(:favorite))