W6D4/art_share/app/controllers/collections_controller.rb

    def index
        catch_record_not_found do
            user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def show
        catch_record_not_found do
            collection = Collection.find(params[:id])
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        catch_parameter_missing do
            collection = Collection.new(collection_params)
            if collection.save
---
INSERT INTO "collections" ("title", "collector_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "\"My Artworks\""], ["collector_id", 6], ["created_at", "2020-05-14 18:14:05.555394"], ["updated_at", "2020-05-14 18:14:05.555394"]]

    def destroy
        collection = Collection.find(params[:id])
        collection.destroy
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 2]]