W6D4/art_share/app/controllers/collection_members_controller.rb

INSERT INTO "collection_members" ("collection_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["collection_id", 1], ["artwork_id", 3], ["created_at", "2020-05-14 18:25:29.663010"], ["updated_at", "2020-05-14 18:25:29.663010"]]
---
    def create
        catch_parameter_missing do
            member = CollectionMember.new(member_params)
            if member.save

SELECT  "collection_members".* FROM "collection_members" WHERE "collection_members"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "collection_members" WHERE "collection_members"."id" = $1  [["id", 2]]
---
    def destroy
        member = CollectionMember.find(params[:id])
        member.destroy