W6D4/art_share/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 2], ["LIMIT", 1]]
---
    def index
        catch_parameter_missing do
            if comment_params[:user_id]
                comments = Comment.find_by(user_id: comment_params[:user_id])
                render json: comments
            elsif comment_params[:artwork_id]
                comments = Comment.find_by(artwork_id: comment_params[:artwork_id])