W6D4/art_share/app/controllers/likes_controller.rb

    def create
       like = Like.new(like_params)
       if like.save
---
INSERT INTO "likes" ("liker_id", "liked_media_type", "liked_media_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["liker_id", 4], ["liked_media_type", "Artwork"], ["liked_media_id", 2], ["created_at", "2020-05-14 17:48:40.829457"], ["updated_at", "2020-05-14 17:48:40.829457"]]

    def destroy
        like = Like.find(params[:id])
        like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 5]]