W6D4/art_share/app/controllers/users_controller.rb

    def index
        catch_parameter_missing(User) do
            if user_params[:username]
                users = User.where("users.username Like '%#{user_params[:username]}%'")
---
SELECT "users".* FROM "users" WHERE (users.username Like '%a%')

    def liked_comments
        catch_record_not_found do
            user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def liked_artworks
        catch_record_not_found do
            user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def show
        catch_record_not_found do
            user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def update
        catch_record_not_found do
            user = User.find(params[:id])
            if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "ryan_mapa@appacademy.io"], ["updated_at", "2020-05-13 21:48:00.857815"], ["id", 3]]

    def destroy
        catch_record_not_found do
            user = User.find(params[:id])
            user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]